Mapper-for-My-Path/app/controllers/institutions_controller.rb

  def index
    @institutions = Institution.all
---
SELECT "institutions".* FROM "institutions"

  def create
    @institution = Institution.new(institution_params)

    respond_to do |format|
      if @institution.save
---
INSERT INTO "institutions" ("address", "name", "classification", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "dasds"], ["name", "asds"], ["classification", "asdsd"], ["created_at", "2015-12-04 22:31:29.230033"], ["updated_at", "2015-12-04 22:31:29.230033"]]

    def set_institution
      @institution = Institution.find(params[:id])
---
SELECT  "institutions".* FROM "institutions" WHERE "institutions"."id" = ? LIMIT 1  [["id", 1]]