Mapper-for-My-Path/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "dlfkdjfdsf"], ["password", "sdfdsf"], ["admin", "t"], ["created_at", "2015-12-04 21:53:28.327579"], ["updated_at", "2015-12-04 21:53:28.327579"]]
---
  def create
    @user = User.new(email: params[:email],
                      password: params[:password],
                      authorization: params[:authorization])

    @user.save